#Область Описание
//
// Авторские права обработки: https://bitbucket.org/vptn/dtcons83.epf
// Авторские права редактор Monaco: https://github.com/salexdv/bsl_console v0.3.2.
//
//	Требования:
//	1. Для запуска потоковых обработчиков требуется 
//		* Добавить экспортную процедуру в модуль ОбщегоНазначенияПереопределяемый
//		* Либо заменить на форме соответствующий код.
//	Процедура ВыполнитьВБезопасномРежиме(Знач Параметры, АдресРезультата = Неопределено) Экспорт
//		Перем Алгоритм, ДополнительныеПараметры;
//	
//		Если НЕ Параметры.Свойство("ОтключитьБезопасныйРежим") Тогда
//			УстановитьБезопасныйРежим(Истина);
//		КонецЕсли; 
//	
//		Параметры.Свойство("Алгоритм", Алгоритм);
//		Параметры.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
//	
//		Если Не ЗначениеЗаполнено(Алгоритм) Тогда
//			Возврат;	
//		КонецЕсли; 
//	
//		Выполнить Алгоритм;
//	
//	КонецПроцедуры

#КонецОбласти 

#Область Изменения
// Релиз
//	4.0.11 - Введено ограничение 1000 элементов при восстановлении списков в параметрах (по запросу)
//	4.0.12 - Убрал зависимость от внешних форм и подсистем (оставил только для фонового выполнения)
//	4.1.0  - Вывод в файл больших результатов и временных таблиц
//	4.1.1  - Навигация по врем.таблицам
//	4.2.0  - + feat: Восстановление позиции алгоритма в дереве при переоткрытии
//			+ feat: работа со схемой запроса
// 				Ускорено формирование результата
// 				Убрал дублирующее выполнение запроса
// 				УсловноеОформление по замерам
// 				Переработана работа с замерами
// 				Теперь можно не удалять "УНИЧТОЖИТЬ [таблица]" из текста запроса
// 	4.2.4  - добавил код ПередвыполнениемЗапроса - в контексте 
// 				Можно использовать переменные "ПараметрыЗапроса, МенеджерВременныхТаблиц"
//	4.2.5 - поправлены ошибки выполнения кода при вложенных циклах
#КонецОбласти 

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает сведения о внешнем отчете.
//
// Возвращаемое значение:
// Структура - Подробнее см. ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке().
//
Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = НовыйСведенияОВнешнейОбработке("1.0.0.0");
	ПараметрыРегистрации.Информация = нСтр("ru='Консоль запросов и обработки данных (управляемый интерфейс + Monaco)'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	ПараметрыРегистрации.Вид = "ДополнительнаяОбработка";
	ПараметрыРегистрации.Версия = "4.2.5";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;

	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Идентификатор = "ОткрытьФорму";
	НоваяКоманда.Представление = НСтр("ru='ОткрытьФорму'");
	НоваяКоманда.Использование = "ОткрытиеФормы";
	НоваяКоманда.Скрыть = Ложь;

	Возврат ПараметрыРегистрации;
КонецФункции

#КонецОбласти

#Область Инициализация

// Формирует шаблон сведений о внешнем отчете или обработке для последующего заполнения.
//
// Параметры:
//   ВерсияБСП - Строка - версия Библиотеки стандартных подсистем, на которую рассчитывают механизмы внешней обработки
//                        или отчета. См. СтандартныеПодсистемыСервер.ВерсияБиблиотеки.
//
// Возвращаемое значение:
//   Структура - параметры внешнего отчета или обработки:
//       * Вид - Строка - Вид внешнего отчета или обработки. Для указания вида рекомендуется использовать функции
//           ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработки<ИмяВида>.
//           Также вид можно указать явно:
//           "ПечатнаяФорма",
//           "ЗаполнениеОбъекта",
//           "СозданиеСвязанныхОбъектов",
//           "Отчет",
//           "ШаблонСообщения",
//           "ДополнительнаяОбработка" или
//           "ДополнительныйОтчет".
//       
//       * Версия - Строка - Версия отчета или обработки (далее - обработки).
//           Задается в формате: "<Старший номер>.<Младший номер>".
//       
//       * Назначение - Массив - Полные имена объектов конфигурации (Строка), для которых предназначен эта обработка.
//                               Необязательное свойство.
//       
//       * Наименование - Строка - Представление для администратора (наименование элемента справочника).
//                                 Если не заполнено, то берется представление объекта метаданных внешней обработки.
//                                 Необязательное свойство. 
//       
//       * БезопасныйРежим - Булево - Признак подключения внешней обработки в безопасном режиме.
//                                    Значение по умолчанию Истина (обработка будет выполняться безопасно).
//                                    В безопасном режиме:
//                                    Игнорируется привилегированный режим.
//                                    Запрещены внешние по отношению к платформе 1С:Предприятия действия:
//                                      COM;
//                                      Загрузка внешних компонентов;
//                                      Запуск внешних приложений и команд операционной системы;
//                                      Доступ к файловой системе, кроме временных файлов;
//                                      Доступ к Интернету.
//                                    Необязательное свойство.
//       
//       * Разрешения - Массив - Дополнительные разрешения, необходимые внешней обработке при работе в безопасном режиме.
//                               Элемент массива - ОбъектXDTO - разрешение типа
//                               {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}PermissionBase.
//                               Для формирования описания разрешения рекомендуется использовать функции
//                               РаботаВБезопасномРежиме.Разрешение<ВидРазрешения>(<ПараметрыРазрешения>).
//                               Необязательное свойство.
//       
//       * Информация - Строка - Краткая информация о внешней обработке.
//                               В этом параметре для администратора рекомендуется дать описание ее возможностей.
//                               Если не заполнено, то берется комментарий объекта метаданных внешней обработки.
//       
//       * ВерсияБСП - Строка - Необязательный. Версия библиотеки, на которую рассчитывают механизмы внешней обработки.
//                              См. СтандартныеПодсистемыСервер.ВерсияБиблиотеки.
//                              Необязательное свойство.
//       
//       * ОпределитьНастройкиФормы - Булево - только для дополнительных отчетов, подключенных к общей форме ФормаОтчета.
//                                             Позволяет переопределять некоторые настройки общей формы отчета и 
//                                             подписываться на ее события.
//                                             Если Истина, то в модуле объекта отчета следует определить процедуру по шаблону:
//           
//           // Настройки общей формы отчета подсистемы "Варианты отчетов".
//           //
//           // Параметры:
//           //   Форма - УправляемаяФорма, Неопределено - Форма отчета или форма настроек отчета.
//           //       Неопределено когда вызов без контекста.
//           //   КлючВарианта - Строка, Неопределено - Имя предопределенного
//           //       или уникальный идентификатор пользовательского варианта отчета.
//           //       Неопределено когда вызов без контекста.
//           //   Настройки - Структура - см. возвращаемое значение
//           //       ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//           //
//           Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
//           	// Код процедуры.
//           КонецПроцедуры
//           
//           Подробнее см. в документации к подсистемам "Дополнительные отчеты и обработки" и "Варианты отчетов".
//           Необязательное свойство.
//       
//       * Команды - ТаблицаЗначений - Настройки команд, поставляемых внешней обработкой (необязательно для отчетов):
//           ** Идентификатор - Строка - Внутреннее имя команды. Для внешних печатных форм (когда Вид = "ПечатнаяФорма"):
//                 Идентификатор может содержать имена одной или нескольких команд печати,
//                 разделенных запятыми. Подробнее см. описание колонки Идентификатор
//                 в функции СоздатьКоллекциюКомандПечати() общего модуля УправлениеПечатью.
//           ** Представление - Строка - Пользовательское представление команды.
//           ** Использование - Строка - Тип команды:
//               "ВызовКлиентскогоМетода",
//               "ВызовСерверногоМетода",
//               "ЗаполнениеФормы",
//               "ОткрытиеФормы" или
//               "СценарийВБезопасномРежиме".
//               Для получения типов команд рекомендуется использовать функции
//               ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКоманды<ИмяТипа>.
//               В комментариях к этим функциям также даны шаблоны процедур-обработчиков команд.
//           ** ПоказыватьОповещение - Булево - если Истина, то при запуске команды выводится оповещение "Команда выполняется...".
//              Действует для всех типов команд, кроме команд по открытию формы (Использование = "ОткрытиеФормы").
//           ** Модификатор - Строка - Дополнительная классификация команды.
//               Для внешних печатных форм (когда Вид = "ПечатнаяФорма"):
//                 "ПечатьMXL" - для печатных форм на основе табличных макетов.
//               Для загрузки данных из файла (когда Вид = "ПечатнаяФорма" и Использование = "ЗагрузкаДанныхИзФайла"):
//                 Модификатор является обязательным для заполнения
//                 и должен содержать полное имя объекта метаданных (справочника),
//                 для которого выполняется загрузка данных.
//           ** Скрыть - Булево - Необязательный. Признак того, что это служебная команда.
//               Если установить в значение Истина, то команда скрывается в карточке дополнительного объекта.
//
Функция НовыйСведенияОВнешнейОбработке(ВерсияБСП = "") Экспорт
	ПараметрыРегистрации = Новый Структура;
	
	ПараметрыРегистрации.Вставить("Вид", "");
	ПараметрыРегистрации.Вставить("Версия", "0.0");
	ПараметрыРегистрации.Вставить("Назначение", Новый Массив);
	ПараметрыРегистрации.Вставить("Наименование", Неопределено);
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина);
	ПараметрыРегистрации.Вставить("Информация", Неопределено);
	ПараметрыРегистрации.Вставить("ВерсияБСП", ВерсияБСП);
	ПараметрыРегистрации.Вставить("ОпределитьНастройкиФормы", Ложь);
	
	ТаблицаКоманд = Новый ТаблицаЗначений;
	ТаблицаКоманд.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	ТаблицаКоманд.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("Скрыть", Новый ОписаниеТипов("Булево"));
	ТаблицаКоманд.Колонки.Добавить("ЗаменяемыеКоманды", Новый ОписаниеТипов("Строка"));
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	ПараметрыРегистрации.Вставить("Разрешения", Новый Массив);
	
	Возврат ПараметрыРегистрации;
КонецФункции

ЭтотОбъект.Версия = ЭтотОбъект.Метаданные().Комментарий;

#КонецОбласти
