#Область Описание
//
// Авторские права обработки: https://bitbucket.org/vptn/dtcons83.epf
// Авторские права редактор Monaco: https://github.com/salexdv/bsl_console v0.3.2.
//
//	Требования:
//	1. Для запуска потоковых обработчиков требуется 
//		* Добавить экспортную процедуру в модуль ОбщегоНазначенияПереопределяемый
//		* Либо заменить на форме соответствующий код.
//	Процедура ВыполнитьВБезопасномРежиме(Знач Параметры, АдресРезультата = Неопределено) Экспорт
//		Перем Алгоритм, ДополнительныеПараметры;
//	
//		Если НЕ Параметры.Свойство("ОтключитьБезопасныйРежим") Тогда
//			УстановитьБезопасныйРежим(Истина);
//		КонецЕсли; 
//	
//		Параметры.Свойство("Алгоритм", Алгоритм);
//		Параметры.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
//	
//		Если Не ЗначениеЗаполнено(Алгоритм) Тогда
//			Возврат;	
//		КонецЕсли; 
//	
//		Выполнить Алгоритм;
//	
//	КонецПроцедуры

#КонецОбласти 

#Область Изменения
// Релиз
//	4.0.11 - Введено ограничение 1000 элементов при восстановлении списков в параметрах (по запросу)
//	4.0.12 - Убрал зависимость от внешних форм и подсистем (оставил только для фонового выполнения)
//	4.1.0  - Вывод в файл больших результатов и временных таблиц
//	4.1.1  - Навигация по врем.таблицам
#КонецОбласти 

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает сведения о внешнем отчете.
//
// Возвращаемое значение:
// Структура - Подробнее см. ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке().
//
Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("1.0.0.0");
	ПараметрыРегистрации.Информация = нСтр("ru='Консоль запросов и обработки данных (управляемый интерфейс + Monaco)'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = "4.1.1";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;

	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Идентификатор = "ОткрытьФорму";
	НоваяКоманда.Представление = НСтр("ru='ОткрытьФорму'");
	НоваяКоманда.Использование = "ОткрытиеФормы";
	НоваяКоманда.Скрыть = Ложь;

	Возврат ПараметрыРегистрации;
КонецФункции

#КонецОбласти

#Область Инициализация

ЭтотОбъект.Версия = ЭтотОбъект.Метаданные().Комментарий;

#КонецОбласти
